# language: ru

Функционал: Обработка платежей в системе Checkout

  Сценарий: Успешная оплата через Stripe
    Дано систему проверки фрода с лимитом 1000.0 евро
    И пустую шину событий
    Когда пользователь из страны "US" совершает покупку на сумму 500.0 евро через фабрику "Stripe"
    Тогда платеж должен завершиться со статусом "success"
    И в ответе провайдером должен быть указан "stripe"

  Сценарий: Блокировка транзакции из опасной зоны
    Дано систему проверки фрода с лимитом 1000.0 евро и черным списком "CN, IR"
    И пустую шину событий
    Когда пользователь из страны "CN" совершает покупку на сумму 100.0 евро через фабрику "Stripe"
    Тогда платеж должен быть отклонен со статусом "rejected"
